shunzi-ycsb/kv1B_ycsb_load.log
./kv/release/tests/db/kv_bench --cache_size=8388608 --db=/mnt/shunzi/test-data/wipdb/kv_ycsb --threads=4 --open_files=40000 --num=120000000 --range=120000000 --reads=2000000 --partition=100 --write_buffer_size=2097152 --batch_size=1000 --stats_interval=10000000 --bloom_bits=16 --low_pool=3 --high_pool=3 --value_size=100 --direct_io=false --histogram=true --log=true --skiplistrep=false --benchmarks=load,overwrite,stats --writes=10000000 --ycsb_ops_num=8000000 --seek_nexts=100 --use_existing_db=false --print_wa=false --log_dio=true --hugepage=true 
Bench num: 120000000, range: 120000000
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    120000000
RawSize:    13275.1 MB (estimated)
FileSize:   7553.1 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
Write buffer: 2048.00 KB. Compression: 0. 
Recover seq# 0, log# 0, min log#0, file# 1
using provided pivots
Log_Recover_Time, 0.0000, BucketCount, 100 , Log_size, 0.0 ,MB
seq# 0, log# 1, min log#0, file# 3
Write buffer: 2048.00 KB. Compression: 0. 
Recover seq# 0, log# 0, min log#0, file# 1
using provided pivots
Log_Recover_Time, 0.0000, BucketCount, 100 , Log_size, 0.0 ,MB
Generate ycsb load sequence.
Start writing
2022/06/30-11:28:37  ... thread 0: (10000000,10000000) ops and (497993.7,497993.7) ops/second in (20.080577,20.080577) seconds
2022/06/30-11:28:58  ... thread 0: (10000000,20000000) ops and (474308.7,485862.7) ops/second in (21.083317,41.163894) seconds
2022/06/30-11:29:19  ... thread 0: (10000000,30000000) ops and (468391.1,479895.8) ops/second in (21.349681,62.513575) seconds
2022/06/30-11:29:40  ... thread 0: (10000000,40000000) ops and (477672.6,479338.0) ops/second in (20.934839,83.448414) seconds
2022/06/30-11:30:01  ... thread 0: (10000000,50000000) ops and (476273.6,478722.0) ops/second in (20.996337,104.444751) seconds
2022/06/30-11:30:23  ... thread 0: (10000000,60000000) ops and (471927.5,477576.0) ops/second in (21.189694,125.634445) seconds
2022/06/30-11:30:44  ... thread 0: (10000000,70000000) ops and (468960.2,476325.9) ops/second in (21.323771,146.958216) seconds
2022/06/30-11:31:05  ... thread 0: (10000000,80000000) ops and (475364.8,476205.5) ops/second in (21.036474,167.994690) seconds
2022/06/30-11:31:26  ... thread 0: (10000000,90000000) ops and (474586.9,476025.1) ops/second in (21.070955,189.065645) seconds
2022/06/30-11:31:47  ... thread 0: (10000000,100000000) ops and (471060.0,475523.9) ops/second in (21.228716,210.294361) seconds
2022/06/30-11:32:08  ... thread 0: (10000000,110000000) ops and (472167.6,475216.8) ops/second in (21.178919,231.473280) seconds
2022/06/30-11:32:29  ... thread 0: (10000000,120000000) ops and (478196.0,475463.7) ops/second in (20.911927,252.385207) seconds
load         :       2.103 micros/op 475461 ops/sec;   52.6 MB/s
Microseconds per op:
Count: 120000000 Average: 2.1032  StdDev: 15.64
Min: 0  Median: 0.5006  Max: 48329
Percentiles: P50: 0.50 P75: 0.75 P99: 0.99 P99.9: 580.08 P99.99: 2293.70
------------------------------------------------------
[       0,       1 ] 119853473  99.878%  99.878% ####################
(       1,       2 ]     8192   0.007%  99.885% 
(       2,       3 ]     3644   0.003%  99.888% 
(       3,       4 ]     1622   0.001%  99.889% 
(       4,       6 ]     1652   0.001%  99.890% 
(       6,      10 ]     4085   0.003%  99.894% 
(      10,      15 ]     4352   0.004%  99.898% 
(      15,      22 ]     2690   0.002%  99.900% 
(      22,      34 ]      219   0.000%  99.900% 
(      34,      51 ]       26   0.000%  99.900% 
(      51,      76 ]       20   0.000%  99.900% 
(      76,     110 ]        3   0.000%  99.900% 
(     110,     170 ]        7   0.000%  99.900% 
(     170,     250 ]        2   0.000%  99.900% 
(     580,     870 ]    46567   0.039%  99.939% 
(     870,    1300 ]    43594   0.036%  99.975% 
(    1300,    1900 ]    15504   0.013%  99.988% 
(    1900,    2900 ]     5964   0.005%  99.993% 
(    2900,    4400 ]      258   0.000%  99.993% 
(    4400,    6600 ]      201   0.000%  99.993% 
(    6600,    9900 ]      304   0.000%  99.994% 
(    9900,   14000 ]     5825   0.005%  99.999% 
(   14000,   22000 ]     1553   0.001% 100.000% 
(   22000,   33000 ]      227   0.000% 100.000% 
(   33000,   50000 ]       16   0.000% 100.000% 

2022/06/30-11:34:28  ... thread 3: (10000000,10000000) ops and (84171.2,84171.2) ops/second in (118.805491,118.805491) seconds
2022/06/30-11:34:28  ... thread 2: (10000000,10000000) ops and (84168.2,84168.2) ops/second in (118.809769,118.809769) seconds
2022/06/30-11:34:28  ... thread 0: (10000000,10000000) ops and (84168.1,84168.1) ops/second in (118.809798,118.809798) seconds
2022/06/30-11:34:28  ... thread 1: (10000000,10000000) ops and (84165.1,84165.1) ops/second in (118.814027,118.814027) seconds
overwrite    :       2.970 micros/op 336643 ops/sec;   37.2 MB/s (10000000 ops)
Microseconds per op:
Count: 40000000 Average: 11.8810  StdDev: 63.07
Min: 0  Median: 0.5025  Max: 119038
Percentiles: P50: 0.50 P75: 0.75 P99: 0.99 P99.9: 1300.00 P99.99: 20025.78
------------------------------------------------------
[       0,       1 ] 39804901  99.512%  99.512% ####################
(       1,       2 ]   128873   0.322%  99.834% 
(       2,       3 ]     8487   0.021%  99.856% 
(       3,       4 ]     4289   0.011%  99.866% 
(       4,       6 ]     1043   0.003%  99.869% 
(       6,      10 ]      683   0.002%  99.871% 
(      10,      15 ]     5145   0.013%  99.884% 
(      15,      22 ]     2691   0.007%  99.890% 
(      22,      34 ]     2251   0.006%  99.896% 
(      34,      51 ]     1542   0.004%  99.900% 
(      51,      76 ]       79   0.000%  99.900% 
(      76,     110 ]        2   0.000%  99.900% 
(     110,     170 ]        1   0.000%  99.900% 
(     170,     250 ]        4   0.000%  99.900% 
(     250,     380 ]        1   0.000%  99.900% 
(     380,     580 ]        3   0.000%  99.900% 
(     580,     870 ]        4   0.000%  99.900% 
(     870,    1300 ]        1   0.000%  99.900% 
(    1300,    1900 ]        1   0.000%  99.900% 
(    2900,    4400 ]       21   0.000%  99.900% 
(    4400,    6600 ]     1187   0.003%  99.903% 
(    6600,    9900 ]    28533   0.071%  99.974% 
(    9900,   14000 ]      474   0.001%  99.976% 
(   14000,   22000 ]     7679   0.019%  99.995% 
(   22000,   33000 ]     1403   0.004%  99.998% 
(   33000,   50000 ]      622   0.002% 100.000% 
(   50000,   75000 ]       58   0.000% 100.000% 
(   75000,  110000 ]       20   0.000% 100.000% 
(  110000,  170000 ]        2   0.000% 100.000% 


                               Compactions
Level Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0    260.55     0.00  17993.91
  1    145.75 17158.02  16938.62
  2     49.22  7144.21   6462.15
BucketCount: 100
WriteAmplification: 2.3005
TotalSize(MB): 17092.45

seq# 120002000, log# 143, min log#140026612649984, file# 11863